apache/nuttx/arch/arm/src/stm32l4/stm32l4_otgfsdev.c
/****************************************************************************
 * arch/arm/src/stm32l4/stm32l4_otgfsdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/irq.h>
#include <arch/board/board.h>

#include "chip.h"
#include "arm_internal.h"
#include "stm32l4_otgfs.h"
#include "stm32l4_pwr.h"

#if defined(CONFIG_USBDEV) && (defined(CONFIG_STM32_OTGFS))

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#ifndef CONFIG_STM32_SYSCFG
#  error "CONFIG_STM32_SYSCFG is required"
#endif

#ifndef CONFIG_USBDEV_EP0_MAXSIZE
#  define CONFIG_USBDEV_EP0_MAXSIZE 64
#endif

#ifndef CONFIG_USBDEV_SETUP_MAXDATASIZE
#  define CONFIG_USBDEV_SETUP_MAXDATASIZE CONFIG_USBDEV_EP0_MAXSIZE
#endif

#ifndef CONFIG_USBDEV_MAXPOWER
#  define CONFIG_USBDEV_MAXPOWER 100  /* mA */
#endif

/* There is 1.25Kb of FIFO memory.  The default partitions this memory
 * so that there is a TxFIFO allocated for each endpoint and with more
 * memory provided for the common RxFIFO.  A more knowledge-able
 * configuration would not allocate any TxFIFO space to OUT endpoints.
 */

#ifndef CONFIG_USBDEV_RXFIFO_SIZE
#  define CONFIG_USBDEV_RXFIFO_SIZE 512
#endif

#ifndef CONFIG_USBDEV_EP0_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP0_TXFIFO_SIZE 128
#endif

#ifndef CONFIG_USBDEV_EP1_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP1_TXFIFO_SIZE 128
#endif

#ifndef CONFIG_USBDEV_EP2_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP2_TXFIFO_SIZE 128
#endif

#ifndef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP3_TXFIFO_SIZE 128
#endif

#ifndef CONFIG_USBDEV_EP4_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP4_TXFIFO_SIZE 128
#endif

#ifndef CONFIG_USBDEV_EP5_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP5_TXFIFO_SIZE 128
#endif

/* Adjust actual number of endpoints based upon size;
 * 0 means 'not available', and we expect that the first 0-length endpoint
 * implies that all others after are unused as well (irrespective of what
 * their size is set to be).
 */

#if CONFIG_USBDEV_EP1_TXFIFO_SIZE == 0
#  undef STM32_NENDPOINTS
#  define STM32_NENDPOINTS 1
#  undef CONFIG_USBDEV_EP2_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP2_TXFIFO_SIZE 0
#  undef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP3_TXFIFO_SIZE 0
#  undef CONFIG_USBDEV_EP4_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP4_TXFIFO_SIZE 0
#  undef CONFIG_USBDEV_EP5_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP5_TXFIFO_SIZE 0
#elif CONFIG_USBDEV_EP2_TXFIFO_SIZE == 0
#  undef STM32_NENDPOINTS
#  define STM32_NENDPOINTS 2
#  undef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP3_TXFIFO_SIZE 0
#  undef CONFIG_USBDEV_EP4_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP4_TXFIFO_SIZE 0
#  undef CONFIG_USBDEV_EP5_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP5_TXFIFO_SIZE 0
#elif CONFIG_USBDEV_EP3_TXFIFO_SIZE == 0
#  undef STM32_NENDPOINTS
#  define STM32_NENDPOINTS 3
#  undef CONFIG_USBDEV_EP4_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP4_TXFIFO_SIZE 0
#  undef CONFIG_USBDEV_EP5_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP5_TXFIFO_SIZE 0
#elif CONFIG_USBDEV_EP4_TXFIFO_SIZE == 0
#  undef STM32_NENDPOINTS
#  define STM32_NENDPOINTS 4
#  undef CONFIG_USBDEV_EP5_TXFIFO_SIZE
#  define CONFIG_USBDEV_EP5_TXFIFO_SIZE 0
#elif CONFIG_USBDEV_EP5_TXFIFO_SIZE == 0
#  undef STM32_NENDPOINTS
#  define STM32_NENDPOINTS 5
#endif

/* Sanity check on allocations specified. */

#if (CONFIG_USBDEV_RXFIFO_SIZE +\
     CONFIG_USBDEV_EP0_TXFIFO_SIZE +\
     CONFIG_USBDEV_EP1_TXFIFO_SIZE +\
     CONFIG_USBDEV_EP2_TXFIFO_SIZE +\
     CONFIG_USBDEV_EP3_TXFIFO_SIZE +\
     CONFIG_USBDEV_EP4_TXFIFO_SIZE +\
     CONFIG_USBDEV_EP5_TXFIFO_SIZE +\
     0 ) > 1280
#  error "FIFO allocations exceed FIFO memory size"
#endif

/* The actual FIFO addresses that we use must be aligned to 4-byte
 * boundaries; FIFO sizes must be provided in units of 32-bit words.
 */

#define STM32_RXFIFO_BYTES     ((CONFIG_USBDEV_RXFIFO_SIZE + 3) & ~3)
#define STM32_RXFIFO_WORDS     ((CONFIG_USBDEV_RXFIFO_SIZE + 3) >> 2)

#define STM32_EP0_TXFIFO_BYTES ((CONFIG_USBDEV_EP0_TXFIFO_SIZE + 3) & ~3)
#define STM32_EP0_TXFIFO_WORDS ((CONFIG_USBDEV_EP0_TXFIFO_SIZE + 3) >> 2)

#if STM32_EP0_TXFIFO_WORDS < 16 || STM32_EP0_TXFIFO_WORDS > 256
#  error "CONFIG_USBDEV_EP0_TXFIFO_SIZE is out of range"
#endif

#define STM32_EP1_TXFIFO_BYTES ((CONFIG_USBDEV_EP1_TXFIFO_SIZE + 3) & ~3)
#define STM32_EP1_TXFIFO_WORDS ((CONFIG_USBDEV_EP1_TXFIFO_SIZE + 3) >> 2)

#if STM32_EP1_TXFIFO_BYTES != 0 && STM32_EP1_TXFIFO_WORDS < 16
#  error "CONFIG_USBDEV_EP1_TXFIFO_SIZE is out of range"
#endif

#define STM32_EP2_TXFIFO_BYTES ((CONFIG_USBDEV_EP2_TXFIFO_SIZE + 3) & ~3)
#define STM32_EP2_TXFIFO_WORDS ((CONFIG_USBDEV_EP2_TXFIFO_SIZE + 3) >> 2)

#if STM32_EP2_TXFIFO_BYTES != 0 && STM32_EP2_TXFIFO_WORDS < 16
#  error "CONFIG_USBDEV_EP2_TXFIFO_SIZE is out of range"
#endif

