apache/nuttx/arch/arm/src/stm32l4/stm32l4_otgfsdev.c
/* Register operations ******************************************************/

#if defined(CONFIG_STM32_USBDEV_REGDEBUG) && defined(CONFIG_DEBUG_FEATURES)
static uint32_t    stm32_getreg(uint32_t addr);
static void        stm32_putreg(uint32_t val, uint32_t addr);
#else
#  define stm32_getreg(addr)     getreg32(addr)
#  define stm32_putreg(val,addr) putreg32(val,addr)
#endif

/* Request queue operations *************************************************/

static struct
stm32_req_s *stm32_req_remfirst(struct stm32_ep_s *privep);
static bool       stm32_req_addlast(struct stm32_ep_s *privep,
                                      struct stm32_req_s *req);

/* Low level data transfers and request operations **************************/

/* Special endpoint 0 data transfer logic */

static
void stm32_ep0in_setupresponse(struct stm32_usbdev_s *priv,
                            uint8_t *data, uint32_t nbytes);
static inline
void stm32_ep0in_transmitzlp(struct stm32_usbdev_s *priv);
static void        stm32_ep0in_activate(void);

static
void stm32_ep0out_ctrlsetup(struct stm32_usbdev_s *priv);

/* IN request and TxFIFO handling */

static void        stm32_txfifo_write(struct stm32_ep_s *privep,
                     uint8_t *buf, int nbytes);
static void        stm32_epin_transfer(struct stm32_ep_s *privep,
                     uint8_t *buf, int nbytes);
static void        stm32_epin_request(struct stm32_usbdev_s *priv,
                     struct stm32_ep_s *privep);

/* OUT request and RxFIFO handling */

static void        stm32_rxfifo_read(struct stm32_ep_s *privep,
                     uint8_t *dest, uint16_t len);
static void        stm32_rxfifo_discard(struct stm32_ep_s *privep,
                     int len);
static void        stm32_epout_complete(struct stm32_usbdev_s *priv,
                     struct stm32_ep_s *privep);
static inline void stm32_ep0out_receive(struct stm32_ep_s *privep,
                     int bcnt);
static inline void stm32_epout_receive(struct stm32_ep_s *privep,
                     int bcnt);
static void        stm32_epout_request(struct stm32_usbdev_s *priv,
                     struct stm32_ep_s *privep);

/* General request handling */

static void        stm32_ep_flush(struct stm32_ep_s *privep);
static void        stm32_req_complete(struct stm32_ep_s *privep,
                     int16_t result);
static void        stm32_req_cancel(struct stm32_ep_s *privep,
                     int16_t status);

/* Interrupt handling *******************************************************/

static
struct stm32_ep_s *stm32_ep_findbyaddr(struct stm32_usbdev_s *priv,
                                           uint16_t eplog);
static int         stm32_req_dispatch(struct stm32_usbdev_s *priv,
                     const struct usb_ctrlreq_s *ctrl);
static void        stm32_usbreset(struct stm32_usbdev_s *priv);

/* Second level OUT endpoint interrupt processing */

static inline void stm32_ep0out_testmode(struct stm32_usbdev_s *priv,
                     uint16_t index);
static inline void stm32_ep0out_stdrequest(struct stm32_usbdev_s *priv,
                     struct stm32_ctrlreq_s *ctrlreq);
static inline void stm32_ep0out_setup(struct stm32_usbdev_s *priv);
static inline void stm32_epout(struct stm32_usbdev_s *priv,
                     uint8_t epno);
static inline
void stm32_epout_interrupt(struct stm32_usbdev_s *priv);

/* Second level IN endpoint interrupt processing */

static inline
void stm32_epin_runtestmode(struct stm32_usbdev_s *priv);
static inline
void stm32_epin(struct stm32_usbdev_s *priv, uint8_t epno);
static inline
void stm32_epin_txfifoempty(struct stm32_usbdev_s *priv,
                              int epno);
static inline void stm32_epin_interrupt(struct stm32_usbdev_s *priv);

/* Other second level interrupt processing */

static inline
void stm32_resumeinterrupt(struct stm32_usbdev_s *priv);
static inline
void stm32_suspendinterrupt(struct stm32_usbdev_s *priv);
static inline void stm32_rxinterrupt(struct stm32_usbdev_s *priv);
static inline void stm32_enuminterrupt(struct stm32_usbdev_s *priv);
#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline
void stm32_isocininterrupt(struct stm32_usbdev_s *priv);
static inline
void stm32_isocoutinterrupt(struct stm32_usbdev_s *priv);
#endif
#ifdef CONFIG_USBDEV_VBUSSENSING
static inline
void stm32_sessioninterrupt(struct stm32_usbdev_s *priv);
static inline void stm32_otginterrupt(struct stm32_usbdev_s *priv);
#endif

/* First level interrupt processing */

static int         stm32_usbinterrupt(int irq, void *context,
                     void *arg);

/* Endpoint operations ******************************************************/

/* Global OUT NAK controls */

static void        stm32_enablegonak(struct stm32_ep_s *privep);
static void        stm32_disablegonak(struct stm32_ep_s *privep);

/* Endpoint configuration */

static int         stm32_epout_configure(struct stm32_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         stm32_epin_configure(struct stm32_ep_s *privep,
                     uint8_t eptype, uint16_t maxpacket);
static int         stm32_ep_configure(struct usbdev_ep_s *ep,
                     const struct usb_epdesc_s *desc, bool last);
static void        stm32_ep0_configure(struct stm32_usbdev_s *priv);

/* Endpoint disable */

static void        stm32_epout_disable(struct stm32_ep_s *privep);
static void        stm32_epin_disable(struct stm32_ep_s *privep);
static int         stm32_ep_disable(struct usbdev_ep_s *ep);

/* Endpoint request management */

static struct usbdev_req_s *stm32_ep_allocreq(struct usbdev_ep_s *ep);
static void        stm32_ep_freereq(struct usbdev_ep_s *ep,
                     struct usbdev_req_s *);

/* Endpoint buffer management */

#ifdef CONFIG_USBDEV_DMA
static void       *stm32_ep_allocbuffer(struct usbdev_ep_s *ep,
                     uint16_t bytes);
static void        stm32_ep_freebuffer(struct usbdev_ep_s *ep,
                     void *buf);
#endif

